app/Controllers/TransferApplication.php

INSERT INTO `transferapplication` (`title`, `body`) VALUES ('new', 'new wewe uw euwe uweuwe')
---
    public function create()
    {
        helper('form');

        $data = $this->request->getPost(['title', 'body']);

        // Checks whether the submitted data passed the validation rules.
        if (! $this->validateData($data, [
            'title' => 'required|max_length[255]|min_length[3]',
            'body'  => 'required|max_length[5000]|min_length[10]',
        ])) {
            // The validation fails, so returns the form.
            return $this->new();
        }

        // Gets the validated data.
        $post = $this->validator->getValidated();

        $model = model(TransferApplicationModel::class);

        $model->save([
            'title' => $post['title'],
            'body'  => $post['body'],
        ]);