app/Models/TransferApplicationModel.php

SELECT *
FROM `transferapplication`
ORDER BY `id` DESC
---
    public function getApplications()
    {
        // return $this->findAll();
        return $this->orderBy('id', 'DESC')->findAll();